# SetGroupId Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
FabricationNetworkChangeService..::..SetGroupId Method
FabricationNetworkChangeService Class See Also
---
This method is deprecated in Revit 2022 and may be removed in a future version of Revit. Please use the `SetPaletteId` method instead.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
[ObsoleteAttribute]
public void SetGroupId(
	int groupId
)
```

Visual Basic
---
```text
<ObsoleteAttribute> _
Public Sub SetGroupId ( _
	groupId As Integer _
)
```

Visual C++
---
```text
[ObsoleteAttribute]
public:
void SetGroupId(
	int groupId
)
```

# ### Parameters
groupId
    Type: System..::..Int32
# See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace